alvin1991/nuttx-arch/nuttx/arch/arm/src/stm32f7/stm32_can_ext.c
/****************************************************************************
 * arch/arm/src/stm32f7/stm32_can_ext.c
 *
 *   Copyright (C) 2011, 2016-2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 *   Copyright (C) 2016 Omni Hoverboards Inc. All rights reserved.
 *   Author: Paul Alexander Patience <paul-a.patience@polymtl.ca>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can_ext.h>

#include "up_internal.h"
#include "up_arch.h"

#include "chip.h"
#include "stm32_can_ext.h"
#include "stm32_gpio.h"


#if defined(CONFIG_CAN) && \
    (defined(CONFIG_STM32F7_CAN1) || defined(CONFIG_STM32F7_CAN1) || defined(CONFIG_STM32F7_CAN3))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Delays *******************************************************************/
/* Time out for INAK bit */

#define INAK_TIMEOUT 65535

/* Bit timing ***************************************************************/
#define CAN_BIT_QUANTA (CONFIG_CAN_TSEG1 + CONFIG_CAN_TSEG2 + 1)

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_STM32_CAN_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_can_s
{
  uint8_t  port;     /* CAN port number (1 or 2) */
  uint8_t  canrx[2]; /* CAN RX FIFO 0/1 IRQ number */
  uint8_t  cantx;    /* CAN TX IRQ number */
  uint8_t  filter;   /* Filter number */
  uint32_t base;     /* Base address of the CAN control registers */
  uint32_t fbase;    /* Base address of the CAN filter registers */
  uint32_t baud;     /* Configured baud */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN Register access */

static uint32_t stm32can_getreg(FAR struct stm32_can_s *priv,
                                int offset);
static uint32_t stm32can_getfreg(FAR struct stm32_can_s *priv,
                                 int offset);
static void stm32can_putreg(FAR struct stm32_can_s *priv, int offset,
                            uint32_t value);
static void stm32can_putfreg(FAR struct stm32_can_s *priv, int offset,
                             uint32_t value);
#ifdef CONFIG_STM32_CAN_REGDEBUG
static void stm32can_dumpctrlregs(FAR struct stm32_can_s *priv,
                                  FAR const char *msg);
static void stm32can_dumpmbregs(FAR struct stm32_can_s *priv,
                                FAR const char *msg);
static void stm32can_dumpfiltregs(FAR struct stm32_can_s *priv,
                                  FAR const char *msg);
#else
#  define stm32can_dumpctrlregs(priv,msg)
#  define stm32can_dumpmbregs(priv,msg)
#  define stm32can_dumpfiltregs(priv,msg)
#endif

/* Filtering (todo) */

#ifdef CAN_EXTID_PROCOTOL
static int  stm32can_addextfilter(FAR struct stm32_can_s *priv,
                                  FAR struct canioc_extfilter_s *arg);
static int  stm32can_delextfilter(FAR struct stm32_can_s *priv,
                                  int arg);
#endif
static int  stm32can_addstdfilter(FAR struct stm32_can_s *priv,
                                  FAR struct canioc_stdfilter_s *arg);
static int  stm32can_delstdfilter(FAR struct stm32_can_s *priv,
                                  int arg);

/* CAN driver methods */

static void stm32can_reset(FAR struct can_ext_dev_s *dev);
static int  stm32can_setup(FAR struct can_ext_dev_s *dev);
static void stm32can_shutdown(FAR struct can_ext_dev_s *dev);
static void stm32can_rxint(FAR struct can_ext_dev_s *dev, bool enable);
static void stm32can_txint(FAR struct can_ext_dev_s *dev, bool enable);
static int  stm32can_ioctl(FAR struct can_ext_dev_s *dev, int cmd,
                           unsigned long arg);
static int  stm32can_remoterequest(FAR struct can_ext_dev_s *dev,
                                   uint16_t id);
static int  stm32can_send(FAR struct can_ext_dev_s *dev,
                          FAR struct can_msg_s *msg);
static bool stm32can_txready(FAR struct can_ext_dev_s *dev);
static bool stm32can_txempty(FAR struct can_ext_dev_s *dev);

